In [2]:
import sqlite3
import pandas as pd

In [4]:
conn = sqlite3.connect('sqlite_db_pythonsqlite.db')
df = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)

In [5]:
df.head()

         name
0    Bookings
1  Facilities
2     Members

In [10]:
#Question 10
query = """
SELECT f.name, SUM(
CASE
WHEN b.memid =0
THEN b.slots * f.guestcost
ELSE b.slots * f.membercost
END ) AS revenue
FROM Facilities AS f
INNER JOIN Bookings AS b ON f.facid = b.facid
GROUP BY f.name
HAVING SUM(
CASE
WHEN b.memid =0
THEN b.slots * f.guestcost
ELSE b.slots * f.membercost
END ) < 1000
ORDER BY revenue DESC;
"""
pd.read_sql_query(query, conn)

            name  revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

In [11]:
#Question 11
query = """
SELECT m.firstname, m.surname, r.firstname AS reference FROM Members m INNER JOIN Members r
ON r.recommendedby = m.memid
WHERE m.memid != 0"""
df = pd.read_sql_query(query, conn)
df.head()

  firstname   surname reference
0    Darren     Smith    Janice
1    Darren     Smith    Gerald
2    Janice  Joplette     Nancy
3       Tim    Rownam       Tim
4    Burton     Tracy    Ponder

In [17]:
#Question 12
query = """SELECT SUM(b.slots) AS slot_usage, f.name AS name,
f.monthlymaintenance AS month
FROM Bookings AS b
LEFT JOIN Facilities  AS f
ON b.facid = f.facid 
 WHERE memid != 0
GROUP BY name, month
ORDER BY name ASC;"""
df = pd.read_sql_query(query, conn)
df.head()

   slot_usage             name  month
0        1086  Badminton Court     50
1         884   Massage Room 1   3000
2          54   Massage Room 2   3000
3         856       Pool Table     15
4         860    Snooker Table     15

In [19]:
#Question 13
query = """SELECT SUM(b.slots) AS slot_usage, f.name AS name, f.monthlymaintenance AS month
FROM Bookings AS b
LEFT JOIN Facilities  AS f
ON b.facid = f.facid 
 WHERE memid != 0
GROUP BY  name, month
ORDER BY name ASC;"""
df = pd.read_sql_query(query, conn)
df.head()

DatabaseError: Execution failed on sql 'SELECT SUM(b.slots) AS slot_usage, f.name AS name, f.monthlymonthlymaintenance AS month
FROM Bookings AS b
LEFT JOIN Facilities  AS f
ON b.facid = f.facid
 WHERE memid != 0
GROUP BY  name, month
ORDER BY name ASC;': no such column: f.monthlymonthlymaintenance

In [ ]:
maintenance AS month
FROM Bookings AS b
LEFT JOIN Facilities  AS f
ON b.facid = f.facid 
 WHERE memid != 0
GROUP BY  name, month
ORDER BY id ASC;"""
df = pd.read_sql_query(query, conn)
df.head()